model.add(Conv2D(8, (3, 3), input_shape=input_shape))
model.add(Activation(activation='relu'))
model.add(BatchNormalization())
model.add(MaxPooling2D((2, 2)))
model.add(BatchNormalization())
model.add(Dropout(rate=0.1))

model.add(Conv2D(12, (3, 1)))
model.add(Activation(activation='relu'))
model.add(BatchNormalization())
model.add(Conv2D(12, (1, 3)))
model.add(Activation(activation='relu'))
model.add(BatchNormalization())
model.add(MaxPooling2D((2, 2)))
model.add(BatchNormalization())
model.add(Dropout(rate=0.1))

model.add(SeparableConv2D(15, (3, 3), depth_multiplier=4))
model.add(Activation(activation='relu'))
model.add(BatchNormalization())
model.add(Dropout(rate=0.1))

model.add(Conv2D(4, (1, 1)))
model.add(Activation(activation='relu'))
model.add(BatchNormalization())
model.add(Dropout(rate=0.1))

model.add(Flatten())

model.add(Dense(18, activation='relu'))
model.add(BatchNormalization())
model.add(Dropout(rate=0.1))
model.add(Dense(10, activation='softmax'))

batch_size = 32
num_epochs = 75

model.summary()

model.compile(loss='categorical_crossentropy',
              optimizer='adam',
              metrics=['accuracy'])


model.fit(x_train, y_train,
          batch_size=batch_size, epochs=num_epochs,
          verbose=1, validation_split=0.1,
          callbacks=[ModelCheckpoint('mini/weights.{epoch:02d}-{loss:.4f}-{acc:.4f}-{val_loss:.4f}-{val_acc:.4f}.hdf5',
                                     monitor='loss,acc,val_loss,val_acc')])



Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_29 (Conv2D)           (None, 26, 26, 8)         80        
_________________________________________________________________
activation_36 (Activation)   (None, 26, 26, 8)         0         
_________________________________________________________________
batch_normalization_57 (Batc (None, 26, 26, 8)         32        
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 13, 13, 8)         0         
_________________________________________________________________
batch_normalization_58 (Batc (None, 13, 13, 8)         32        
_________________________________________________________________
dropout_36 (Dropout)         (None, 13, 13, 8)         0         
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 11, 13, 12)        300       
_________________________________________________________________
activation_37 (Activation)   (None, 11, 13, 12)        0         
_________________________________________________________________
batch_normalization_59 (Batc (None, 11, 13, 12)        48        
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 11, 11, 12)        444       
_________________________________________________________________
activation_38 (Activation)   (None, 11, 11, 12)        0         
_________________________________________________________________
batch_normalization_60 (Batc (None, 11, 11, 12)        48        
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 5, 5, 12)          0         
_________________________________________________________________
batch_normalization_61 (Batc (None, 5, 5, 12)          48        
_________________________________________________________________
dropout_37 (Dropout)         (None, 5, 5, 12)          0         
_________________________________________________________________
separable_conv2d_8 (Separabl (None, 3, 3, 15)          1167      
_________________________________________________________________
activation_39 (Activation)   (None, 3, 3, 15)          0         
_________________________________________________________________
batch_normalization_62 (Batc (None, 3, 3, 15)          60        
_________________________________________________________________
dropout_38 (Dropout)         (None, 3, 3, 15)          0         
_________________________________________________________________
conv2d_32 (Conv2D)           (None, 3, 3, 4)           64        
_________________________________________________________________
activation_40 (Activation)   (None, 3, 3, 4)           0         
_________________________________________________________________
batch_normalization_63 (Batc (None, 3, 3, 4)           16        
_________________________________________________________________
dropout_39 (Dropout)         (None, 3, 3, 4)           0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 36)                0         
_________________________________________________________________
dense_15 (Dense)             (None, 18)                666       
_________________________________________________________________
batch_normalization_64 (Batc (None, 18)                72        
_________________________________________________________________
dropout_40 (Dropout)         (None, 18)                0         
_________________________________________________________________
dense_16 (Dense)             (None, 10)                190       
=================================================================
Total params: 3,267
Trainable params: 3,089
Non-trainable params: 178


Test score:  0.0299518044221
Test accuracy:  0.9904
