model.add(Conv2D(8, (3, 3), input_shape=input_shape, activation='relu'))
model.add(MaxPooling2D((2, 2)))
model.add(BatchNormalization())
model.add(Dropout(rate=0.1))
model.add(Conv2D(12, (3, 1), activation='relu'))
model.add(BatchNormalization())
model.add(Conv2D(12, (1, 3), activation='relu'))
model.add(MaxPooling2D((2, 2)))
model.add(BatchNormalization())
model.add(Dropout(rate=0.1))
model.add(Conv2D(16, (3, 1), activation='relu'))
model.add(BatchNormalization())
model.add(Conv2D(16, (1, 3), activation='relu'))
model.add(BatchNormalization())
model.add(Dropout(rate=0.1))
model.add(Conv2D(4, (1, 1), activation='relu'))
model.add(BatchNormalization())
model.add(Dropout(rate=0.1))
model.add(Flatten())
model.add(Dense(20, activation='relu'))
model.add(Dropout(rate=0.1))
model.add(Dense(10, activation='softmax'))

batch_size = 32
num_epochs = 75

model.summary()

model.compile(loss='categorical_crossentropy',
              optimizer='adam',
              metrics=['accuracy'])


model.fit(x_train, y_train,
          batch_size=batch_size, epochs=num_epochs,
          verbose=1, validation_split=0.1,
          callbacks=[ModelCheckpoint('mini/weights.{epoch:02d}-{loss:.4f}-{acc:.4f}-{val_loss:.4f}-{val_acc:.4f}.hdf5',
                                     monitor='loss,acc,val_loss,val_acc')])




Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_55 (Conv2D)           (None, 26, 26, 8)         80        
_________________________________________________________________
max_pooling2d_19 (MaxPooling (None, 13, 13, 8)         0         
_________________________________________________________________
batch_normalization_55 (Batc (None, 13, 13, 8)         32        
_________________________________________________________________
dropout_46 (Dropout)         (None, 13, 13, 8)         0         
_________________________________________________________________
conv2d_56 (Conv2D)           (None, 11, 13, 12)        300       
_________________________________________________________________
batch_normalization_56 (Batc (None, 11, 13, 12)        48        
_________________________________________________________________
conv2d_57 (Conv2D)           (None, 11, 11, 12)        444       
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 5, 5, 12)          0         
_________________________________________________________________
batch_normalization_57 (Batc (None, 5, 5, 12)          48        
_________________________________________________________________
dropout_47 (Dropout)         (None, 5, 5, 12)          0         
_________________________________________________________________
conv2d_58 (Conv2D)           (None, 3, 5, 16)          592       
_________________________________________________________________
batch_normalization_58 (Batc (None, 3, 5, 16)          64        
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 3, 3, 16)          784       
_________________________________________________________________
batch_normalization_59 (Batc (None, 3, 3, 16)          64        
_________________________________________________________________
dropout_48 (Dropout)         (None, 3, 3, 16)          0         
_________________________________________________________________
conv2d_60 (Conv2D)           (None, 3, 3, 4)           68        
_________________________________________________________________
batch_normalization_60 (Batc (None, 3, 3, 4)           16        
_________________________________________________________________
dropout_49 (Dropout)         (None, 3, 3, 4)           0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 36)                0         
_________________________________________________________________
dense_19 (Dense)             (None, 20)                740       
_________________________________________________________________
dropout_50 (Dropout)         (None, 20)                0         
_________________________________________________________________
dense_20 (Dense)             (None, 10)                210       
=================================================================
Total params: 3,490
Trainable params: 3,354
Non-trainable params: 136


Test score:  0.0342673188853
Test accuracy:  0.9907
