model = Sequential(name='24SConv')

model.add(Conv2D(8, (3, 3), input_shape=input_shape))
model.add(Activation(activation='relu'))
model.add(BatchNormalization())
model.add(MaxPooling2D((2, 2)))
model.add(BatchNormalization())
model.add(Dropout(rate=0.1))

model.add(SeparableConv2D(16, (3, 3), depth_multiplier=2))
model.add(Activation(activation='relu'))
model.add(BatchNormalization())
model.add(MaxPooling2D((2, 2)))
model.add(BatchNormalization())
model.add(Dropout(rate=0.1))

model.add(SeparableConv2D(24, (3, 3), depth_multiplier=2))
model.add(Activation(activation='relu'))
model.add(BatchNormalization())
model.add(Dropout(rate=0.1))

model.add(Conv2D(4, (1, 1)))
model.add(Activation(activation='relu'))
model.add(BatchNormalization())
model.add(Dropout(rate=0.1))

model.add(Flatten())

model.add(Dense(18, activation='relu'))
model.add(BatchNormalization())
model.add(Dropout(rate=0.1))
model.add(Dense(10, activation='softmax'))

batch_size = 32
num_epochs = 75

model.summary()

model.compile(loss='categorical_crossentropy',
              optimizer='adam',
              metrics=['accuracy'])

w_path = os.path.join('mini', model.name)

if not os.path.exists(w_path):
    os.makedirs(w_path)

f_name = os.path.join(w_path, 'weights.{epoch:02d}-{loss:.4f}-{acc:.4f}-{val_loss:.4f}-{val_acc:.4f}.hdf5')

model.fit(x_train, y_train,
          batch_size=batch_size, epochs=num_epochs,
          verbose=1, validation_split=0.1,
          callbacks=[ModelCheckpoint(f_name)])



Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_111 (Conv2D)          (None, 26, 26, 8)         80        
_________________________________________________________________
activation_157 (Activation)  (None, 26, 26, 8)         0         
_________________________________________________________________
batch_normalization_253 (Bat (None, 26, 26, 8)         32        
_________________________________________________________________
max_pooling2d_64 (MaxPooling (None, 13, 13, 8)         0         
_________________________________________________________________
batch_normalization_254 (Bat (None, 13, 13, 8)         32        
_________________________________________________________________
dropout_169 (Dropout)        (None, 13, 13, 8)         0         
_________________________________________________________________
separable_conv2d_47 (Separab (None, 11, 11, 16)        416       
_________________________________________________________________
activation_158 (Activation)  (None, 11, 11, 16)        0         
_________________________________________________________________
batch_normalization_255 (Bat (None, 11, 11, 16)        64        
_________________________________________________________________
max_pooling2d_65 (MaxPooling (None, 5, 5, 16)          0         
_________________________________________________________________
batch_normalization_256 (Bat (None, 5, 5, 16)          64        
_________________________________________________________________
dropout_170 (Dropout)        (None, 5, 5, 16)          0         
_________________________________________________________________
separable_conv2d_48 (Separab (None, 3, 3, 24)          1080      
_________________________________________________________________
activation_159 (Activation)  (None, 3, 3, 24)          0         
_________________________________________________________________
batch_normalization_257 (Bat (None, 3, 3, 24)          96        
_________________________________________________________________
dropout_171 (Dropout)        (None, 3, 3, 24)          0         
_________________________________________________________________
conv2d_112 (Conv2D)          (None, 3, 3, 4)           100       
_________________________________________________________________
activation_160 (Activation)  (None, 3, 3, 4)           0         
_________________________________________________________________
batch_normalization_258 (Bat (None, 3, 3, 4)           16        
_________________________________________________________________
dropout_172 (Dropout)        (None, 3, 3, 4)           0         
_________________________________________________________________
flatten_35 (Flatten)         (None, 36)                0         
_________________________________________________________________
dense_69 (Dense)             (None, 18)                666       
_________________________________________________________________
batch_normalization_259 (Bat (None, 18)                72        
_________________________________________________________________
dropout_173 (Dropout)        (None, 18)                0         
_________________________________________________________________
dense_70 (Dense)             (None, 10)                190       
=================================================================
Total params: 2,908
Trainable params: 2,720
Non-trainable params: 188


Test score:  0.0319789474596
Test accuracy:  0.9905
